// Метод_квадратичної_інтерполяії.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <stdio.h>
#include <math.h>
#include <Windows.h>

float function(float x); // Прототип функції, необхідної для обчилення значення функції в точці

float delta1(float a, float b, float c, float f_a, float f_b, float f_c); // Прототип функції, необхідної для обрахування дельти на першій ітерації 

float delta2(float a, float b, float c, float f_a, float f_b, float f_c); // Прототип функції, необхідної для обрахування дельти на другій ітерації 

int main() // Головна функція програми
{
    SetConsoleOutputCP(1251); // Налаштування кодування консолі для коректного виводу кирилиці
    printf("\n\t|--------------------------------------------------------------------------------------------------------------------------------|");
    printf("\n\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ЗНАХОДЖЕННЯ ЕКСТРЕМУМУ ФУНКЦІЇ МЕТОДОМ КВАДРАТИЧНОЇ ІНТЕРПОЛЯЦІЇ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("\t|--------------------------------------------------------------------------------------------------------------------------------|\n\n");
    
    float x1, x2, epsilon, A, H, a, b, c, f_a, f_b, f_c, delta, f_delta, f_min, f_max;
    int iter = 0;

    printf("\n\t\t|---------------------------------------------------------------------------------------------------------|");
    printf("\n\t\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ УМОВА ТА ВСТАНОВЛЕННЯ ПАРАМЕТРІВ ПРОГРАМИ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("\t\t|---------------------------------------------------------------------------------------------------------|\n\n");

	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("Задана функція: y = (x - 2) * e^x\n");
    puts("Введіть інтервал пошуку екстремуму [a; b]:");
    printf("a = ");
    scanf_s("%f", &x1);
    printf("b = ");
    scanf_s("%f", &x2);
    while (x1 >= x2)
    {
        puts("[УВАГА] - Введіть раз інтервал пошуку екстремуму [a; b]:");
        printf("a = ");
        scanf_s("%f", &x1);
        printf("b = ");
        scanf_s("%f", &x2);
    }
    printf("Введіть точність обчислень epsilon: ");
    scanf_s("%f", &epsilon);
    while (epsilon < 0)
    {
        printf("[УВАГА] - Введіть ще раз точність обчислень epsilon: ");
        scanf_s("%f", &epsilon);
    }
    printf("Введіть початковий крок H: ");
    scanf_s("%f", &H);
    while (H < 0)
    {
        printf("[УВАГА] - Введіть ще раз початковий крок H: ");
        scanf_s("%f", &H);
    }

    // Розрахунок початкового положення точок

    A = (x2 - x1) / 4;
    printf("Початкова точка A = %.3f\n", A);
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n");


    a = A;
    b = A + H;

    f_a = function(a);
    f_b = function(b);

    if (f_a < f_b)
    {
        c = A - H;
    }

    else
    {
        c = A + 2 * H;
    }

    f_c = function(c);

    // Основний цикл ітерацій алгоритму

    while (1)
    {
        iter++;

        if (iter == 1)
        {
            delta = delta1(a, b, c, f_a, f_b, f_c);
        }

        else
        {
            delta = delta2(a, b, c, f_a, f_b, f_c);
        }

        f_delta = function(delta);

        printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
        printf("\nІтерація %d:\n", iter);
        printf("x1 = %.4f, f(x1) = %.4f\n", a, f_a);
        printf("x2 = %.4f, f(x2) = %.4f\n", b, f_b);
        printf("x3 = %.4f, f(x3) = %.4f\n", c, f_c);
        printf("delta = %.4f, f(delta) = %.4f\n", delta, f_delta);
        printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");

        f_min = f_a;

        if (f_b < f_min) 
        { 
            f_min = f_b; 
        }

        if (f_c < f_min) 
        { 
            f_min = f_c; 
        }

        f_max = f_a;

        if (f_b > f_max)
        {
            f_max = f_b;
        }

        if (f_c > f_max)
        {
            f_max = f_c;
        }

        if (f_delta > f_max)
        {
            f_max = f_delta;
        }

        if (fabsf(f_min - f_delta) <= epsilon)
        {
            break;
        }

        if (f_a == f_max)
        {
            printf("Відкидаємо точку x = %.4f\n", a);
            a = delta;
            f_a = f_delta;
        }

        else if (f_b == f_max)
        {
            printf("Відкидаємо точку x = %.4f\n", b);
            b = delta;
            f_b = f_delta;
        }
        else
        {
            printf("Відкидаємо точку x = %.4f\n", c);
            c = delta;
            f_c = f_delta;
        }
    }

    // Вивдення результатів на екран

    printf("\n\t\t|-------------------------------------------------------------------------|");
    printf("\n\t\t|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ РЕЗУЛЬТАТ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("\t\t|-------------------------------------------------------------------------|\n\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("Точка мінімуму x = %.4f\n", delta);
    printf("Мінімальне значення f(x) = %.4f\n", function(delta));
    printf("Задана точність: %.3f\n", epsilon);
    printf("Кількість ітерацій: %d\n", iter);
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");

    return 0; // Успішне завершення роботи програми
}

float function(float x) // Визначення функції, необхідної для обчилення значення функції в точці
{
    return (x - 2) * exp(x);
}

float delta1(float a, float b, float c, float f_a, float f_b, float f_c) // Визначення функції, необхідної для обрахування дельти на першій ітерації 
{
    return 0.5 * ((((pow(b, 2) - pow(c, 2)) * f_a) + ((pow(c, 2) - pow(a, 2)) * f_b) + ((pow(a, 2) - pow(b, 2)) * f_c)) / (((b - c) * f_a) + ((c - a) * f_b) + ((a - b) * f_c)));
}

float delta2(float a, float b, float c, float f_a, float f_b, float f_c)  // Визначення функції, необхідної для обрахування дельти на другій ітерації 
{
    return 0.5 * (a + b) + (0.5 * (f_a - f_b) * (b - c) * (c - a)) / (((b - c) * f_a) + ((c - a) * f_b) + ((a - b) * f_c));
}
